// 11.1 Генерируется случайное число n в интервале от [20 - 99]. Проверяем, делится ли оно на целое число d, введенное с клавиатуры.

// Console.Clear();

// int n = new Random().Next(20, 100);
// Console.WriteLine($"Сгенерировано число: {n}");

// Console.Write("Введите целое число: ");
// int d = int.Parse(Console.ReadLine());

// if (n % d == 0)
// {
//     Console.WriteLine($"{n} делится на {d} без остатка");
// }

// else
// {
//     Console.WriteLine($"{n} не делится на {d} без остатка");
// }

// ***********************************************************************************************************************************

// 11.2 Генерируется 2 случайных числа a и b в интервале [10 - 30]. Если a>b, то выводится их разность, если a<b, то выводится сумма.
// Если a==b, то выводится сообщене "Числа равны"

// Console.Clear();

// int a = new Random().Next(10, 30);
// int b = new Random().Next(10, 30);
// Console.WriteLine($"Сгенерированы числа: {a} и {b}");

// if (a > b)
// {
//     Console.WriteLine($"Их разность: {a - b}");

// }

// else if (a < b) Console.WriteLine($"Их сумма: {a + b}");

// else if (a == b) Console.WriteLine("Числа равны");

// ***********************************************************************************************************************************

// 11.3 Генерируется 2 случайных числа c и d в интервале [-10, 10]. Если оба числа четные, то выводится их частное, если оба нечетные, 
// то их сумма. Если одно число четное, а другое нет, то выводится их произведение. 

// double c = new Random().Next(-10, 10);
// double d = new Random().Next(-10, 10);
// Console.WriteLine($"Сгенерированы числа: {c} и {d}");

// if (c % 2 == 0 && d % 2 == 0)
// {
//     Console.WriteLine($"Их частное: {c / d}");

// }

// else if (c % 2 != 0 && d % 2 != 0) Console.WriteLine($"Их сумма: {c + d}");

// else if ((c % 2 == 0 && d % 2 != 0) || (c % 2 != 0 && d % 2 == 0)) Console.WriteLine($"Их произведение: {c * d}");

// ***********************************************************************************************************************************

// 11.4 По введенному номеру месяца выводится название поры года и сообщение: сессия, каникулы, 1 семестр, 2 семестр

// Console.Clear();

// Console.WriteLine("Введите номер месяца: ");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num > 0 && num <= 12)

// {
//     if (num >= 1 && num <= 5)
//     {
//         Console.Write("Это 2 семестр, ");

//         if (num == 1 || num == 2)
//         {
//             Console.Write("зима");
//         }

//         else
//         {
//             Console.Write("весна");
//         }
//     }

//     if (num >= 7 && num <= 8)
//     {
//         Console.WriteLine("Это каникулы, лето");
//     }

//     if (num >= 9 && num <= 11)
//     {
//         Console.WriteLine("Это 1 семестр, осень");

//     }

//     if (num == 6 || num == 12)
//     {
//         Console.Write("Это сессия, ");

//         if (num == 6)
//         {
//             Console.Write("лето");
//         }
//         else
//         {
//             Console.Write("зима");
//         }
//     }

// }

// else
// {
//     Console.Write("Введенный номер некорректен!");
// }


// ***********************************************************************************************************************************

// 11.5 Прверяется сообщение веса и роста (ввод веса и роста). 
// Вывод одного из сообщений: Норма, Нужно похудеть, Нужно поправиться. Нормальный вес в кг = рост в см минус 100 плс минус 10%

// Console.Clear();

// Console.WriteLine("Введите вес в кг: ");
// double weight = Convert.ToDouble(Console.ReadLine());

// Console.WriteLine("Введите рост в см: ");
// double height = Convert.ToDouble(Console.ReadLine());

// if (weight >= (height - 100) * 0.9 && weight <= (height - 100) * 1.1)

// {
//     Console.WriteLine("Норма");
// }

// else
// {
//     if (weight < (height - 100) * 0.9)
//     {
//         Console.WriteLine("Нужно поправиться");
//     }

//     else
//     {
//         Console.WriteLine("Нужно похудеть");
//     }
// }



// ***********************************************************************************************************************************

// 11.6 Введенная цифра от 1 до 5 выводится прописью

// Console.Clear();

// Console.WriteLine("Введите цифру от 1 до 5: ");
// int num = Convert.ToInt32(Console.ReadLine());
// string mes = " ";

// switch (num)
// {
//     case (1): mes = "Один"; break;
//     case (2): mes = "Два"; break;
//     case (3): mes = "Три"; break;
//     case (4): mes = "Четыре"; break;
//     case (5): mes = "Пять"; break;
//     default: mes = "Вы ввели некорректный номер"; break;
// }
// Console.WriteLine(mes);


// ***********************************************************************************************************************************

// 11.7 Выводится название предмета по введенной первой букве: ф - физика, м - математика,  и - история, г - георафия, б - биология

// Console.Clear();
// Console.WriteLine("Введите первую букву предмета: ");
// string letter = Console.ReadLine();
// string mes = " ";

// switch (letter)
// {
//     case ("ф"): mes = "физика"; break;
//     case ("м"): mes = "математика"; break;
//     case ("и"): mes = "история"; break;
//     case ("г"): mes = "география"; break;
//     case ("б"): mes = "биология"; break;
//     default: mes = "чуфырь"; break;
// }

// Console.WriteLine(mes);

// ***********************************************************************************************************************************

// 11.8 Выводится название страны и ее столицы по введенной первой букве. б - Беларусь, Минск, р - Россия, Москва, л - Литва, Вильнюс

// Console.Clear();
// Console.WriteLine("Введите первую букву в названии страны: ");
// string letter = Console.ReadLine();
// string mes = " ";

// switch (letter.ToLower())
// {
//     case ("б"): mes = "Беларусь, Минск"; break;
//     case ("р"): mes = "Россия, Москва"; break;
//     case ("л"): mes = "Литва, Вильнюс"; break;
//     default: mes = "шта?"; break;
// }

// Console.WriteLine(mes);

// ***********************************************************************************************************************************

// 11.9 По введенному номеру выводится название дня недели и сообщение рд или выходной

// Console.Clear();
// Console.WriteLine("Введите номер дня недели: ");
// int num = Convert.ToInt32(Console.ReadLine());
// string mes = " ";

// switch (num)
// {
//     case (1): mes = "Это понедельник, "; break;
//     case (2): mes = "Это вторник, "; break;
//     case (3): mes = "Это среда, "; break;
//     case (4): mes = "Это четверг, "; break;
//     case (5): mes = "Это пятница, "; break;
//     case (6): mes = "Это суббота, "; break;
//     case (7): mes = "Это воскресенье, "; break;

//     default: mes = "Введенный номер не соответствует дню недели"; break;
// }

// Console.Write(mes);

// if (num >= 6 && num <= 7)
// {
//     Console.WriteLine("выходной");
// }

// if (num >= 1 && num <= 5)
// {
//     Console.WriteLine("рабочий день");
// }

// else Console.Write("");

// ***********************************************************************************************************************************

// 11.20 Проверяется правильность введенного логина строго из 5 букв и пароля из 6 и более цифр